blogfolio/app/controllers/application_controller.rb

    def load_photos(options = {})
      unless Rails.cache.exist?('photos') && Rails.cache.exist?('plant_photo')
        logger.warn("** Loading Flickr photos")
        options = options.reverse_merge(:user_id => '88016824@N00', :per_page => 8)
        flickr = Flickr.new("#{Rails.root}/config/flickr_fu.yml")
        Rails.cache.write('plant_photo', flickr.photos.search(options.merge(:tags => 'plants', :per_page => 8, :page => 2)).photos.compact.rand)
---
SELECT * FROM `pages`