blogfolio/app/controllers/blog_controller.rb

SELECT * FROM `pages`
---
  def index
    @posts = Post.published.full_information.reverse_chronological_order.paginate(:page => params[:page], :per_page => 10)