blogfolio/app/controllers/pages_controller.rb

SELECT * FROM `pages` ORDER BY name ASC
---
  def index
    @pages = Page.ordered.all

SELECT * FROM `pages` WHERE (url = 'contact') LIMIT 1
---
  def show
    @page = Page.find(params[:id])

SELECT * FROM `pages` WHERE (url = 'contact') LIMIT 1
---
  def edit
    @page = Page.find(params[:id])

INSERT INTO `pages` (`name`, `updated_at`, `url`, `description`, `content`, `created_at`) VALUES('Contact us', '2008-12-25 17:35:40', 'contact', 'Contact form for Foliosus Web Design in Portland, Oregon, for sending in feedback, or making inquiries about projects.', 'I\'m a contact form.', '2008-12-25 17:35:40')
---
  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save